<h1> AULA 03: ADICIONANDO COLUNAS AO DATAFRAME </h1>

In [3]:
import pandas as pd
import numpy as np

In [12]:
notasAlunos_DF = pd.DataFrame ({
    "Nome" : ["Ana", "Pedro", "João"],
    "Nota 1": [4,6,8],
    "Nota 2": [5,6,8],
    "Nota 3": [8,6,2],
    "Nota 4": [6,4,9],
})

#Observações
#01 - Chave do dicionário é nome da coluna 
#02 - Cada lista de elementos representa uma coluna no DataFrame

display (notasAlunos_DF)


#Adicionando uma nova coluna ao meu DataFrame

notasAlunos_DF["Média"] = (notasAlunos_DF["Nota 1"] + notasAlunos_DF["Nota 2"] + notasAlunos_DF["Nota 3"] +notasAlunos_DF["Nota 4"]) /4
print()
display (notasAlunos_DF)

notasAlunos_DF['Faltas'] = [4,6,5]
display(notasAlunos_DF)

print(notasAlunos_DF.values) #Retorna um array numpy do mesmo DataFrame

    Nome  Nota 1  Nota 2  Nota 3  Nota 4
0    Ana       4       5       8       6
1  Pedro       6       6       6       4
2   João       8       8       2       9

    Nome  Nota 1  Nota 2  Nota 3  Nota 4  Média
0    Ana       4       5       8       6   5.75
1  Pedro       6       6       6       4   5.50
2   João       8       8       2       9   6.75

    Nome  Nota 1  Nota 2  Nota 3  Nota 4  Média  Faltas
0    Ana       4       5       8       6   5.75       4
1  Pedro       6       6       6       4   5.50       6
2   João       8       8       2       9   6.75       5

[['Ana' 4 5 8 6 5.75 4]
 ['Pedro' 6 6 6 4 5.5 6]
 ['João' 8 8 2 9 6.75 5]]

In [13]:
#Posso modificar os elementos de meu DataFrame
#Primeira Maneira
novas_Faltas = [4,5,8]
notasAlunos_DF['Faltas'] = novas_Faltas 
display(notasAlunos_DF)

    Nome  Nota 1  Nota 2  Nota 3  Nota 4  Média  Faltas
0    Ana       4       5       8       6   5.75       4
1  Pedro       6       6       6       4   5.50       5
2   João       8       8       2       9   6.75       8

In [14]:
#Segunda Maneira
notasAlunos_DF.loc[1,"Nota 2"] = 8 #Atributo Loc [Valor da linha, Valor/Nome da coluna]
print(notasAlunos_DF)

    Nome  Nota 1  Nota 2  Nota 3  Nota 4  Média  Faltas
0    Ana       4       5       8       6   5.75       4
1  Pedro       6       8       6       4   5.50       5
2   João       8       8       2       9   6.75       8